p_teslaS/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -55);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		$internalField;
    }
    wall
    {
        type            noSlip;
    }
    car
    {
	type		noSlip;
    }
    outlet
    {
	type		zeroGradient;
    }
    patches
    {
	type		zeroGradient;
    }
}


// ************************************************************************* //
